open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Bounded chip-level validation for the standard BK7258 JPEG V4L2 M2M ABI.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_JPEG_M2M_VALIDATION

#include <errno.h>
#include <fcntl.h>
#include <inttypes.h>
#include <poll.h>
#include <sched.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <sys/ioctl.h>
#include <sys/videoio.h>
#include <syslog.h>
#include <unistd.h>

#include <nuttx/cache.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>

#include <arch/chip/bk7258_jpeg_m2m_validation.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BKJMVAL_WIDTH                   32u
#define BKJMVAL_HEIGHT                  16u
#define BKJMVAL_DECODED_SIZE            \
  (BKJMVAL_WIDTH * BKJMVAL_HEIGHT * 2u)
#define BKJMVAL_BUFFER_COUNT            2u
#define BKJMVAL_STACKSIZE               6144
#define BKJMVAL_POLL_SLICE_MS           100
#define BKJMVAL_POLL_ATTEMPTS           30u
#define BKJMVAL_REQUIRED_CAPS           \
  (V4L2_CAP_VIDEO_M2M | V4L2_CAP_STREAMING)
#define BKJMVAL_FIXTURE_BYTES           \
  ((uint32_t)sizeof(g_bkjmval_fixture))

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bkjmval_buffer_stats_s
{
  uint32_t crc32;
  uint32_t nonzero;
  uint8_t minimum;
  uint8_t maximum;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Deterministic 32x16, 8-bit baseline JPEG with 4:2:2 sampling.  It is a
 * generated chip fixture and has no sensor, panel, GPIO, or board binding.
 */

static const uint8_t g_bkjmval_fixture[] =
{
  0xff, 0xd8, 0xff, 0xe0, 0x00, 0x10, 0x4a, 0x46, 0x49, 0x46, 0x00, 0x01,
  0x01, 0x00, 0x00, 0x01, 0x00, 0x01, 0x00, 0x00, 0xff, 0xdb, 0x00, 0x43,
  0x00, 0x08, 0x06, 0x06, 0x07, 0x06, 0x05, 0x08, 0x07, 0x07, 0x07, 0x09,
  0x09, 0x08, 0x0a, 0x0c, 0x14, 0x0d, 0x0c, 0x0b, 0x0b, 0x0c, 0x19, 0x12,
  0x13, 0x0f, 0x14, 0x1d, 0x1a, 0x1f, 0x1e, 0x1d, 0x1a, 0x1c, 0x1c, 0x20,
  0x24, 0x2e, 0x27, 0x20, 0x22, 0x2c, 0x23, 0x1c, 0x1c, 0x28, 0x37, 0x29,
  0x2c, 0x30, 0x31, 0x34, 0x34, 0x34, 0x1f, 0x27, 0x39, 0x3d, 0x38, 0x32,
  0x3c, 0x2e, 0x33, 0x34, 0x32, 0xff, 0xdb, 0x00, 0x43, 0x01, 0x09, 0x09,
  0x09, 0x0c, 0x0b, 0x0c, 0x18, 0x0d, 0x0d, 0x18, 0x32, 0x21, 0x1c, 0x21,
  0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32,
  0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32,
  0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32,
  0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32, 0x32,
  0x32, 0x32, 0xff, 0xc0, 0x00, 0x11, 0x08, 0x00, 0x10, 0x00, 0x20, 0x03,
  0x01, 0x21, 0x00, 0x02, 0x11, 0x01, 0x03, 0x11, 0x01, 0xff, 0xc4, 0x00,
  0x1f, 0x00, 0x00, 0x01, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x02, 0x03, 0x04, 0x05,
  0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0xff, 0xc4, 0x00, 0xb5, 0x10, 0x00,
  0x02, 0x01, 0x03, 0x03, 0x02, 0x04, 0x03, 0x05, 0x05, 0x04, 0x04, 0x00,
  0x00, 0x01, 0x7d, 0x01, 0x02, 0x03, 0x00, 0x04, 0x11, 0x05, 0x12, 0x21,
  0x31, 0x41, 0x06, 0x13, 0x51, 0x61, 0x07, 0x22, 0x71, 0x14, 0x32, 0x81,
  0x91, 0xa1, 0x08, 0x23, 0x42, 0xb1, 0xc1, 0x15, 0x52, 0xd1, 0xf0, 0x24,
  0x33, 0x62, 0x72, 0x82, 0x09, 0x0a, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x25,
  0x26, 0x27, 0x28, 0x29, 0x2a, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x3a,
  0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x4a, 0x53, 0x54, 0x55, 0x56,
  0x57, 0x58, 0x59, 0x5a, 0x63, 0x64, 0x65, 0x66, 0x67, 0x68, 0x69, 0x6a,
  0x73, 0x74, 0x75, 0x76, 0x77, 0x78, 0x79, 0x7a, 0x83, 0x84, 0x85, 0x86,
  0x87, 0x88, 0x89, 0x8a, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99,
  0x9a, 0xa2, 0xa3, 0xa4, 0xa5, 0xa6, 0xa7, 0xa8, 0xa9, 0xaa, 0xb2, 0xb3,
  0xb4, 0xb5, 0xb6, 0xb7, 0xb8, 0xb9, 0xba, 0xc2, 0xc3, 0xc4, 0xc5, 0xc6,
  0xc7, 0xc8, 0xc9, 0xca, 0xd2, 0xd3, 0xd4, 0xd5, 0xd6, 0xd7, 0xd8, 0xd9,
  0xda, 0xe1, 0xe2, 0xe3, 0xe4, 0xe5, 0xe6, 0xe7, 0xe8, 0xe9, 0xea, 0xf1,
  0xf2, 0xf3, 0xf4, 0xf5, 0xf6, 0xf7, 0xf8, 0xf9, 0xfa, 0xff, 0xc4, 0x00,
  0x1f, 0x01, 0x00, 0x03, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01,
  0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x02, 0x03, 0x04, 0x05,
  0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0xff, 0xc4, 0x00, 0xb5, 0x11, 0x00,
  0x02, 0x01, 0x02, 0x04, 0x04, 0x03, 0x04, 0x07, 0x05, 0x04, 0x04, 0x00,
  0x01, 0x02, 0x77, 0x00, 0x01, 0x02, 0x03, 0x11, 0x04, 0x05, 0x21, 0x31,
  0x06, 0x12, 0x41, 0x51, 0x07, 0x61, 0x71, 0x13, 0x22, 0x32, 0x81, 0x08,
  0x14, 0x42, 0x91, 0xa1, 0xb1, 0xc1, 0x09, 0x23, 0x33, 0x52, 0xf0, 0x15,
  0x62, 0x72, 0xd1, 0x0a, 0x16, 0x24, 0x34, 0xe1, 0x25, 0xf1, 0x17, 0x18,
  0x19, 0x1a, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x35, 0x36, 0x37, 0x38, 0x39,
  0x3a, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x4a, 0x53, 0x54, 0x55,
  0x56, 0x57, 0x58, 0x59, 0x5a, 0x63, 0x64, 0x65, 0x66, 0x67, 0x68, 0x69,
  0x6a, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78, 0x79, 0x7a, 0x82, 0x83, 0x84,
  0x85, 0x86, 0x87, 0x88, 0x89, 0x8a, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97,
  0x98, 0x99, 0x9a, 0xa2, 0xa3, 0xa4, 0xa5, 0xa6, 0xa7, 0xa8, 0xa9, 0xaa,
  0xb2, 0xb3, 0xb4, 0xb5, 0xb6, 0xb7, 0xb8, 0xb9, 0xba, 0xc2, 0xc3, 0xc4,
  0xc5, 0xc6, 0xc7, 0xc8, 0xc9, 0xca, 0xd2, 0xd3, 0xd4, 0xd5, 0xd6, 0xd7,
  0xd8, 0xd9, 0xda, 0xe2, 0xe3, 0xe4, 0xe5, 0xe6, 0xe7, 0xe8, 0xe9, 0xea,
  0xf2, 0xf3, 0xf4, 0xf5, 0xf6, 0xf7, 0xf8, 0xf9, 0xfa, 0xff, 0xda, 0x00,
  0x0c, 0x03, 0x01, 0x00, 0x02, 0x11, 0x03, 0x11, 0x00, 0x3f, 0x00, 0xe3,
  0x34, 0x3f, 0x0c, 0x7d, 0xdf, 0xdd, 0xfe, 0x95, 0xe8, 0x16, 0xde, 0x1e,
  0x16, 0xfa, 0x5c, 0xf2, 0x60, 0xa1, 0x11, 0x90, 0xac, 0x33, 0x90, 0x4f,
  0x03, 0xa7, 0xb9, 0x14, 0xb0, 0xf5, 0xaf, 0x34, 0x8d, 0xf0, 0x99, 0x97,
  0xb3, 0xc3, 0xce, 0x6d, 0xda, 0xc9, 0xbf, 0xc0, 0x4d, 0x3f, 0xc3, 0xfe,
  0x54, 0x4a, 0xaa, 0xb8, 0x76, 0xf4, 0xea, 0x07, 0xad, 0x5c, 0xd4, 0xe7,
  0xd0, 0xb4, 0x8d, 0x16, 0x71, 0x73, 0xaa, 0x5b, 0xc7, 0x26, 0xf1, 0x09,
  0x48, 0xdf, 0x7b, 0x86, 0xcf, 0x20, 0xaa, 0xe4, 0x8e, 0x01, 0xcf, 0x15,
  0xc3, 0x9d, 0x62, 0x2a, 0xe3, 0x73, 0x48, 0x61, 0xe8, 0xae, 0x65, 0x0b,
  0x2f, 0x2b, 0xbd, 0x5f, 0xa7, 0x45, 0xf2, 0x3c, 0x9c, 0xb6, 0xad, 0x6a,
  0xb8, 0x2a, 0xaa, 0x8a, 0x6d, 0xf2, 0xcb, 0xf2, 0x76, 0xd7, 0xa6, 0xa6,
  0x1d, 0x9f, 0x8a, 0xb4, 0x7b, 0x6d, 0xc9, 0x65, 0x69, 0x71, 0x78, 0xeb,
  0x8d, 0x8d, 0xb7, 0xcb, 0x8d, 0xba, 0x67, 0x93, 0xf3, 0x0c, 0x73, 0xfc,
  0x3d, 0x47, 0xe3, 0x56, 0xf5, 0xdf, 0x19, 0x6a, 0xff, 0x00, 0xd8, 0x93,
  0x25, 0xa5, 0x9d, 0xbd, 0xa4, 0x72, 0xba, 0x2a, 0xb6, 0x37, 0xc8, 0x98,
  0xf9, 0x8f, 0x27, 0xe5, 0x39, 0xda, 0x47, 0xdd, 0xef, 0xf8, 0xd7, 0xb9,
  0x96, 0xe5, 0x51, 0xa7, 0x25, 0x5b, 0x17, 0x2d, 0x16, 0xb6, 0x5e, 0x5a,
  0xea, 0xfe, 0xf5, 0xa7, 0xde, 0x75, 0x60, 0xb2, 0x9e, 0x5c, 0x05, 0x49,
  0xe2, 0xa5, 0xf6, 0x5f, 0xba, 0xbc, 0xd5, 0xb5, 0x7f, 0x7d, 0xd2, 0xf9,
  0x33, 0x92, 0xb7, 0xb6, 0xd5, 0x75, 0x99, 0x0b, 0x5f, 0xde, 0x5c, 0xdc,
  0x2b, 0x3f, 0x98, 0x23, 0x92, 0x42, 0x51, 0x4f, 0x3d, 0x17, 0xa0, 0xea,
  0x7a, 0x0a, 0xd7, 0xd4, 0x3c, 0x3d, 0xb6, 0xd6, 0xd2, 0x0f, 0x2b, 0xef,
  0xb9, 0x7d, 0xde, 0x98, 0x18, 0xff, 0x00, 0xd9, 0xbf, 0x4a, 0xe0, 0xc2,
  0x62, 0x15, 0x4c, 0x57, 0x3a, 0x56, 0xbb, 0x6c, 0xf4, 0xa7, 0x8a, 0xa7,
  0x85, 0xca, 0x67, 0x0a, 0x49, 0x25, 0x64, 0xac, 0xb4, 0xdd, 0xa4, 0x7f,
  0xff, 0xd9
};

