open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
static volatile bool g_bkjmval_started;

/****************************************************************************
 * Public Data
 ****************************************************************************/

/* Intentionally non-static so a debugger can inspect the bounded result
 * without depending on a console or an RPMsg syslog transport.
 */

volatile struct bk7258_jpeg_m2m_validation_diag_s
  g_bk7258_jpeg_m2m_validation_diag;

_Static_assert(sizeof(struct bk7258_jpeg_m2m_validation_diag_s) == 0x9cu,
               "unexpected JPEG M2M validation diagnostic ABI");

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int bkjmval_errno(void)
{
  return errno > 0 ? -errno : -EIO;
}

static void bkjmval_set_stage(uint32_t stage)
{
  g_bk7258_jpeg_m2m_validation_diag.stage = stage;
}

static void bkjmval_check_passed(void)
{
  g_bk7258_jpeg_m2m_validation_diag.checks++;
}

static uint32_t bkjmval_crc32(FAR const uint8_t *data, size_t length)
{
  uint32_t crc = UINT32_MAX;
  size_t index;
  unsigned int bit;

  for (index = 0; index < length; index++)
    {
      crc ^= data[index];
      for (bit = 0; bit < 8; bit++)
        {
          crc = (crc >> 1) ^ (0xedb88320u &
                              (uint32_t)-(int32_t)(crc & 1u));
        }
    }

  return ~crc;
}

static void bkjmval_buffer_stats(FAR const uint8_t *data, size_t length,
                                 FAR struct bkjmval_buffer_stats_s *stats)
{
  size_t index;

  memset(stats, 0, sizeof(*stats));
  stats->minimum = UINT8_MAX;
  for (index = 0; index < length; index++)
    {
      if (data[index] != 0)
        {
          stats->nonzero++;
        }

      if (data[index] < stats->minimum)
        {
          stats->minimum = data[index];
        }

      if (data[index] > stats->maximum)
        {
          stats->maximum = data[index];
        }
    }

  stats->crc32 = bkjmval_crc32(data, length);
}

static int bkjmval_capture_storage(FAR size_t *cache_line,
                                   FAR uint32_t *storage)
{
  uint64_t aligned;
  size_t line;

  if (storage == NULL)
    {
      return -EINVAL;
    }

  line = up_get_dcache_linesize();
  if (line == 0)
    {
      line = sizeof(uintptr_t);
    }

  if ((line & (line - 1u)) != 0)
    {
      return -EIO;
    }

  aligned = (BKJMVAL_DECODED_SIZE + (uint64_t)line - 1u) &
            ~((uint64_t)line - 1u);
  if (aligned > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  *storage = (uint32_t)aligned;
  if (cache_line != NULL)
    {
      *cache_line = line;
    }

  return 0;
}

static int bkjmval_expect_errno(int fd, int request, unsigned long argument,
                                int expected)
{
  int ret;

  errno = 0;
  ret = ioctl(fd, request, argument);
  if (ret >= 0)
    {
      return -EPROTO;
    }

  if (errno != expected)
    {
      return bkjmval_errno();
    }

  bkjmval_check_passed();
  return 0;
}

static int bkjmval_enum_format(int fd, uint32_t type, uint32_t fourcc,
                               bool compressed)
{
  struct v4l2_fmtdesc desc;
  int ret;

  memset(&desc, 0, sizeof(desc));
  desc.type = type;
  if (ioctl(fd, VIDIOC_ENUM_FMT, (unsigned long)(uintptr_t)&desc) < 0)
    {
      return bkjmval_errno();
    }

  if (desc.index != 0 || desc.type != type || desc.pixelformat != fourcc ||
      ((desc.flags & V4L2_FMT_FLAG_COMPRESSED) != 0) != compressed ||
      desc.description[0] == '\0')
    {
      return -EPROTO;
    }

  bkjmval_check_passed();
  desc.index = 1;
  ret = bkjmval_expect_errno(fd, VIDIOC_ENUM_FMT,
                             (unsigned long)(uintptr_t)&desc, EINVAL);
  if (ret < 0)
    {
      return ret;
    }

  return 0;
}

static void bkjmval_make_format(FAR struct v4l2_format *format,
                                uint32_t type, uint32_t fourcc)
{
  memset(format, 0, sizeof(*format));
  format->type = type;
  format->fmt.pix.width = BKJMVAL_WIDTH;
  format->fmt.pix.height = BKJMVAL_HEIGHT;
  format->fmt.pix.pixelformat = fourcc;
  format->fmt.pix.field = V4L2_FIELD_ANY;
}

static int bkjmval_check_format(FAR const struct v4l2_format *format,
                                uint32_t type, uint32_t fourcc)
{
  uint32_t storage;
  int ret;

  if (format->type != type || format->fmt.pix.width != BKJMVAL_WIDTH ||
      format->fmt.pix.height != BKJMVAL_HEIGHT ||
      format->fmt.pix.pixelformat != fourcc ||
      format->fmt.pix.field != V4L2_FIELD_NONE ||
      format->fmt.pix.colorspace != V4L2_COLORSPACE_JPEG)
    {
      return -EPROTO;
    }

  if (type == V4L2_BUF_TYPE_VIDEO_OUTPUT)
    {
      if (format->fmt.pix.bytesperline != 0 ||
          format->fmt.pix.sizeimage !=
            (uint32_t)CONFIG_BK7258_JPEG_M2M_MAX_INPUT_SIZE)
        {
          return -EPROTO;
        }
    }
  else
    {
      ret = bkjmval_capture_storage(NULL, &storage);
      if (ret < 0)
        {
          return ret;
        }

      if (format->fmt.pix.bytesperline != BKJMVAL_WIDTH * 2u ||
          format->fmt.pix.sizeimage != storage)
        {
          return -EPROTO;
        }
    }

  bkjmval_check_passed();
  return 0;
}

static int bkjmval_ioctl_format(int fd, int request, uint32_t type,
                                uint32_t fourcc,
                                FAR struct v4l2_format *result)
{
  struct v4l2_format format;
  int ret;

  bkjmval_make_format(&format, type, fourcc);
  if (ioctl(fd, request, (unsigned long)(uintptr_t)&format) < 0)
    {
      return bkjmval_errno();
    }

  ret = bkjmval_check_format(&format, type, fourcc);
  if (ret < 0)
    {
      return ret;
    }

  if (result != NULL)
    {
      *result = format;
    }

  return 0;
}

static int bkjmval_get_format(int fd, uint32_t type, uint32_t fourcc,
                              FAR struct v4l2_format *result)
{
  struct v4l2_format format;
  int ret;

  memset(&format, 0, sizeof(format));
  format.type = type;
  if (ioctl(fd, VIDIOC_G_FMT, (unsigned long)(uintptr_t)&format) < 0)
    {
      return bkjmval_errno();
    }

  ret = bkjmval_check_format(&format, type, fourcc);
  if (ret >= 0 && result != NULL)
    {
      *result = format;
    }

  return ret;
}

static int bkjmval_request_buffers(int fd, uint32_t type,
                                   uint32_t memory, uint32_t count)
{
  struct v4l2_requestbuffers request;

