open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
  memset(&request, 0, sizeof(request));
  request.type = type;
  request.memory = memory;
  request.count = count;
  if (ioctl(fd, VIDIOC_REQBUFS,
            (unsigned long)(uintptr_t)&request) < 0)
    {
      return bkjmval_errno();
    }

  if (request.type != type || request.memory != memory ||
      request.count != count || request.mode != V4L2_BUF_MODE_FIFO)
    {
      return -EPROTO;
    }

  bkjmval_check_passed();
  return 0;
}

static int bkjmval_queue_capture(int fd, FAR uint8_t *capture,
                                 uint32_t length)
{
  struct v4l2_buffer buffer;

  memset(&buffer, 0, sizeof(buffer));
  buffer.index = 0;
  buffer.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  buffer.memory = V4L2_MEMORY_USERPTR;
  buffer.m.userptr = (unsigned long)(uintptr_t)capture;
  buffer.length = length;
  if (ioctl(fd, VIDIOC_QBUF, (unsigned long)(uintptr_t)&buffer) < 0)
    {
      return bkjmval_errno();
    }

  return 0;
}

static int bkjmval_queue_output(int fd, uint32_t bytesused,
                                uint32_t timestamp_tag)
{
  struct v4l2_buffer buffer;

  memset(&buffer, 0, sizeof(buffer));
  buffer.index = 0;
  buffer.type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
  buffer.bytesused = bytesused;
  buffer.memory = V4L2_MEMORY_USERPTR;
  buffer.m.userptr = (unsigned long)(uintptr_t)g_bkjmval_fixture;
  buffer.length = BKJMVAL_FIXTURE_BYTES;
  buffer.timestamp.tv_sec = (time_t)timestamp_tag;
  buffer.timestamp.tv_usec = (long)(timestamp_tag * 1000u);
  if (ioctl(fd, VIDIOC_QBUF, (unsigned long)(uintptr_t)&buffer) < 0)
    {
      return bkjmval_errno();
    }

  return 0;
}

static int bkjmval_queue_pair(int fd, FAR uint8_t *capture,
                              uint32_t capture_length, uint32_t bytesused,
                              uint32_t timestamp_tag)
{
  int ret;

  ret = bkjmval_queue_capture(fd, capture, capture_length);
  if (ret >= 0)
    {
      ret = bkjmval_queue_output(fd, bytesused, timestamp_tag);
    }

  return ret;
}

static int bkjmval_try_dequeue(int fd, uint32_t type,
                               FAR struct v4l2_buffer *buffer,
                               FAR bool *done)
{
  struct v4l2_buffer candidate;

  if (*done)
    {
      return 0;
    }

  memset(&candidate, 0, sizeof(candidate));
  candidate.type = type;
  candidate.memory = V4L2_MEMORY_USERPTR;
  errno = 0;
  if (ioctl(fd, VIDIOC_DQBUF,
            (unsigned long)(uintptr_t)&candidate) < 0)
    {
      if (errno == EAGAIN)
        {
          return 0;
        }

      return bkjmval_errno();
    }

  *buffer = candidate;
  *done = true;
  g_bk7258_jpeg_m2m_validation_diag.dqbuf_count++;
  return 0;
}

static int bkjmval_wait_buffers(int fd, bool need_output,
                                bool need_capture,
                                FAR struct v4l2_buffer *output,
                                FAR struct v4l2_buffer *capture)
{
  bool output_done = !need_output;
  bool capture_done = !need_capture;
  unsigned int attempt;
  int ret;

  memset(output, 0, sizeof(*output));
  memset(capture, 0, sizeof(*capture));
  for (attempt = 0; attempt < BKJMVAL_POLL_ATTEMPTS; attempt++)
    {
      struct pollfd pfd;

      ret = bkjmval_try_dequeue(fd, V4L2_BUF_TYPE_VIDEO_OUTPUT,
                                output, &output_done);
      if (ret < 0)
        {
          return ret;
        }

      ret = bkjmval_try_dequeue(fd, V4L2_BUF_TYPE_VIDEO_CAPTURE,
                                capture, &capture_done);
      if (ret < 0)
        {
          return ret;
        }

      if (output_done && capture_done)
        {
          return 0;
        }

      memset(&pfd, 0, sizeof(pfd));
      pfd.fd = fd;
      if (!output_done)
        {
          pfd.events |= POLLOUT;
        }

      if (!capture_done)
        {
          pfd.events |= POLLIN;
        }

      g_bk7258_jpeg_m2m_validation_diag.poll_calls++;
      errno = 0;
      ret = poll(&pfd, 1, BKJMVAL_POLL_SLICE_MS);
      if (ret < 0)
        {
          if (errno == EINTR)
            {
              continue;
            }

          return bkjmval_errno();
        }

      if ((pfd.revents & (POLLERR | POLLHUP | POLLNVAL)) != 0)
        {
          return -EIO;
        }
    }

  return -ETIMEDOUT;
}

static bool bkjmval_same_timestamp(FAR const struct v4l2_buffer *first,
                                   FAR const struct v4l2_buffer *second,
                                   uint32_t tag)
{
  return first->timestamp.tv_sec == (time_t)tag &&
         first->timestamp.tv_usec == (long)(tag * 1000u) &&
         first->timestamp.tv_sec == second->timestamp.tv_sec &&
         first->timestamp.tv_usec == second->timestamp.tv_usec;
}

static int bkjmval_validate_success(
  FAR const struct v4l2_buffer *output,
  FAR const struct v4l2_buffer *capture,
  FAR const uint8_t *capture_data, uint32_t capture_storage,
  uint32_t sequence, uint32_t tag,
  FAR struct bkjmval_buffer_stats_s *stats)
{
  if (output->type != V4L2_BUF_TYPE_VIDEO_OUTPUT ||
      output->memory != V4L2_MEMORY_USERPTR || output->index != 0 ||
      output->m.userptr != (unsigned long)(uintptr_t)g_bkjmval_fixture ||
      output->length != BKJMVAL_FIXTURE_BYTES ||
      output->bytesused != BKJMVAL_FIXTURE_BYTES ||
      (output->flags & V4L2_BUF_FLAG_ERROR) != 0 ||
      capture->type != V4L2_BUF_TYPE_VIDEO_CAPTURE ||
      capture->memory != V4L2_MEMORY_USERPTR || capture->index != 0 ||
      capture->m.userptr != (unsigned long)(uintptr_t)capture_data ||
      capture->length != capture_storage ||
      capture->bytesused != BKJMVAL_DECODED_SIZE ||
      (capture->flags & V4L2_BUF_FLAG_ERROR) != 0 ||
      capture->field != V4L2_FIELD_NONE || capture->sequence != sequence ||
      !bkjmval_same_timestamp(output, capture, tag))
    {
      return -EPROTO;
    }

  bkjmval_buffer_stats(capture_data, capture->bytesused, stats);
  if (stats->nonzero == 0 || stats->minimum == stats->maximum)
    {
      return -ENODATA;
    }

  bkjmval_check_passed();
  return 0;
}

static int bkjmval_validate_negative(
  FAR const struct v4l2_buffer *output,
  FAR const struct v4l2_buffer *capture,
  FAR const uint8_t *capture_data, uint32_t capture_storage)
{
  if (output->type != V4L2_BUF_TYPE_VIDEO_OUTPUT ||
      output->memory != V4L2_MEMORY_USERPTR || output->index != 0 ||
      output->m.userptr != (unsigned long)(uintptr_t)g_bkjmval_fixture ||
      output->bytesused != BKJMVAL_FIXTURE_BYTES - 2u ||
      (output->flags & V4L2_BUF_FLAG_ERROR) == 0 ||
      capture->type != V4L2_BUF_TYPE_VIDEO_CAPTURE ||
      capture->memory != V4L2_MEMORY_USERPTR || capture->index != 0 ||
      capture->m.userptr != (unsigned long)(uintptr_t)capture_data ||
      capture->length != capture_storage || capture->bytesused != 0 ||
      (capture->flags & V4L2_BUF_FLAG_ERROR) == 0)
    {
      return -EPROTO;
    }

