open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
  bkjmval_check_passed();
  return 0;
}

static int bkjmval_validate_drain(FAR const struct v4l2_buffer *output)
{
  if (output->type != V4L2_BUF_TYPE_VIDEO_OUTPUT ||
      output->memory != V4L2_MEMORY_USERPTR || output->index != 0 ||
      output->m.userptr != (unsigned long)(uintptr_t)g_bkjmval_fixture ||
      output->bytesused != BKJMVAL_FIXTURE_BYTES ||
      (output->flags & V4L2_BUF_FLAG_ERROR) == 0)
    {
      return -EPROTO;
    }

  bkjmval_check_passed();
  return 0;
}

static int bkjmval_run(void)
{
  struct bkjmval_buffer_stats_s valid_stats = {0};
  struct bkjmval_buffer_stats_s recovery_stats = {0};
  struct v4l2_capability capability;
  struct v4l2_format capture_format;
  struct v4l2_format late_format;
  struct v4l2_buffer output;
  struct v4l2_buffer capture;
  struct v4l2_requestbuffers request;
  FAR uint8_t *capture_data = NULL;
  enum v4l2_buf_type type;
  uint32_t capture_storage;
  size_t alignment;
  bool output_on = false;
  bool capture_on = false;
  int second_fd;
  int fd = -1;
  int ret;

  if ((size_t)BKJMVAL_FIXTURE_BYTES >
        (size_t)CONFIG_BK7258_JPEG_M2M_MAX_INPUT_SIZE ||
      (uint32_t)CONFIG_BK7258_JPEG_M2M_MAX_WIDTH < BKJMVAL_WIDTH ||
      (uint32_t)CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT < BKJMVAL_HEIGHT)
    {
      return -E2BIG;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_OPEN);
  fd = open(CONFIG_BK7258_JPEG_M2M_DEVPATH, O_RDWR | O_NONBLOCK);
  if (fd < 0)
    {
      return bkjmval_errno();
    }

  bkjmval_check_passed();
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_SECOND_OPEN);
  errno = 0;
  second_fd = open(CONFIG_BK7258_JPEG_M2M_DEVPATH,
                   O_RDWR | O_NONBLOCK);
  if (second_fd >= 0)
    {
      close(second_fd);
      ret = -EPROTO;
      goto out;
    }

  if (errno != EBUSY)
    {
      ret = bkjmval_errno();
      goto out;
    }

  bkjmval_check_passed();
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_QUERYCAP);
  memset(&capability, 0, sizeof(capability));
  if (ioctl(fd, VIDIOC_QUERYCAP,
            (unsigned long)(uintptr_t)&capability) < 0)
    {
      ret = bkjmval_errno();
      goto out;
    }

  g_bk7258_jpeg_m2m_validation_diag.capabilities =
    capability.capabilities;
  g_bk7258_jpeg_m2m_validation_diag.device_caps =
    capability.device_caps;
  if ((capability.capabilities & BKJMVAL_REQUIRED_CAPS) !=
        BKJMVAL_REQUIRED_CAPS ||
      (capability.device_caps & BKJMVAL_REQUIRED_CAPS) !=
        BKJMVAL_REQUIRED_CAPS || capability.driver[0] == '\0' ||
      capability.card[0] == '\0')
    {
      ret = -EPROTO;
      goto out;
    }

  bkjmval_check_passed();
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_ENUM_FMT);
  ret = bkjmval_enum_format(fd, V4L2_BUF_TYPE_VIDEO_OUTPUT,
                            V4L2_PIX_FMT_JPEG, true);
  if (ret < 0)
    {
      goto out;
    }

  ret = bkjmval_enum_format(fd, V4L2_BUF_TYPE_VIDEO_CAPTURE,
                            V4L2_PIX_FMT_YUYV, false);
  if (ret < 0)
    {
      goto out;
    }

  g_bk7258_jpeg_m2m_validation_diag.output_fourcc = V4L2_PIX_FMT_JPEG;
  g_bk7258_jpeg_m2m_validation_diag.capture_fourcc = V4L2_PIX_FMT_YUYV;

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_TRY_FMT);
  ret = bkjmval_ioctl_format(fd, VIDIOC_TRY_FMT,
                             V4L2_BUF_TYPE_VIDEO_OUTPUT,
                             V4L2_PIX_FMT_JPEG, NULL);
  if (ret < 0)
    {
      goto out;
    }

  ret = bkjmval_ioctl_format(fd, VIDIOC_TRY_FMT,
                             V4L2_BUF_TYPE_VIDEO_CAPTURE,
                             V4L2_PIX_FMT_YUYV, NULL);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_S_FMT);
  ret = bkjmval_ioctl_format(fd, VIDIOC_S_FMT,
                             V4L2_BUF_TYPE_VIDEO_OUTPUT,
                             V4L2_PIX_FMT_JPEG, NULL);
  if (ret < 0)
    {
      goto out;
    }

  ret = bkjmval_ioctl_format(fd, VIDIOC_S_FMT,
                             V4L2_BUF_TYPE_VIDEO_CAPTURE,
                             V4L2_PIX_FMT_YUYV, &capture_format);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_G_FMT);
  ret = bkjmval_get_format(fd, V4L2_BUF_TYPE_VIDEO_OUTPUT,
                           V4L2_PIX_FMT_JPEG, NULL);
  if (ret < 0)
    {
      goto out;
    }

  ret = bkjmval_get_format(fd, V4L2_BUF_TYPE_VIDEO_CAPTURE,
                           V4L2_PIX_FMT_YUYV, &capture_format);
  if (ret < 0)
    {
      goto out;
    }

  g_bk7258_jpeg_m2m_validation_diag.width = capture_format.fmt.pix.width;
  g_bk7258_jpeg_m2m_validation_diag.height = capture_format.fmt.pix.height;
  g_bk7258_jpeg_m2m_validation_diag.capture_size =
    capture_format.fmt.pix.sizeimage;

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_MMAP_REJECT);
  memset(&request, 0, sizeof(request));
  request.type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
  request.memory = V4L2_MEMORY_MMAP;
  request.count = BKJMVAL_BUFFER_COUNT;
  ret = bkjmval_expect_errno(fd, VIDIOC_REQBUFS,
                             (unsigned long)(uintptr_t)&request, ENOTSUP);
  if (ret < 0)
    {
      goto out;
    }

  memset(&request, 0, sizeof(request));
  request.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  request.memory = V4L2_MEMORY_MMAP;
  request.count = BKJMVAL_BUFFER_COUNT;
  ret = bkjmval_expect_errno(fd, VIDIOC_REQBUFS,
                             (unsigned long)(uintptr_t)&request, ENOTSUP);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_USERPTR_REQBUFS);
  ret = bkjmval_request_buffers(fd, V4L2_BUF_TYPE_VIDEO_OUTPUT,
                                V4L2_MEMORY_USERPTR,
                                BKJMVAL_BUFFER_COUNT);
  if (ret < 0)
    {
      goto out;
    }

  ret = bkjmval_request_buffers(fd, V4L2_BUF_TYPE_VIDEO_CAPTURE,
                                V4L2_MEMORY_USERPTR,
                                BKJMVAL_BUFFER_COUNT);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_LATE_S_FMT);
  bkjmval_make_format(&late_format, V4L2_BUF_TYPE_VIDEO_OUTPUT,
                      V4L2_PIX_FMT_JPEG);
  ret = bkjmval_expect_errno(fd, VIDIOC_S_FMT,
                             (unsigned long)(uintptr_t)&late_format, EBUSY);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_make_format(&late_format, V4L2_BUF_TYPE_VIDEO_CAPTURE,
                      V4L2_PIX_FMT_YUYV);
  ret = bkjmval_expect_errno(fd, VIDIOC_S_FMT,
                             (unsigned long)(uintptr_t)&late_format, EBUSY);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_ALLOCATE);
  ret = bkjmval_capture_storage(&alignment, &capture_storage);
  if (ret < 0)
    {
      goto out;
    }

  if (capture_format.fmt.pix.sizeimage != capture_storage)
    {
      ret = -EPROTO;
      goto out;
    }

  capture_data = kmm_memalign(alignment, capture_storage);
  if (capture_data == NULL)
    {
      ret = -ENOMEM;
      goto out;
    }

  if (((uintptr_t)capture_data & (alignment - 1u)) != 0)
    {
      ret = -EFAULT;
      goto out;
    }

