open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
  bkjmval_check_passed();
  memset(capture_data, 0xa5, capture_storage);
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_VALID_QBUF);
  ret = bkjmval_queue_pair(fd, capture_data, capture_storage,
                           BKJMVAL_FIXTURE_BYTES, 1u);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_STREAMON);
  type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  if (ioctl(fd, VIDIOC_STREAMON, (unsigned long)(uintptr_t)&type) < 0)
    {
      ret = bkjmval_errno();
      goto out;
    }

  capture_on = true;
  type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
  if (ioctl(fd, VIDIOC_STREAMON, (unsigned long)(uintptr_t)&type) < 0)
    {
      ret = bkjmval_errno();
      goto out;
    }

  output_on = true;
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_VALID_DQBUF);
  ret = bkjmval_wait_buffers(fd, true, true, &output, &capture);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_VALID_RESULT);
  ret = bkjmval_validate_success(&output, &capture, capture_data,
                                 capture_storage, 0u, 1u, &valid_stats);
  g_bk7258_jpeg_m2m_validation_diag.valid_output_flags = output.flags;
  g_bk7258_jpeg_m2m_validation_diag.valid_capture_flags = capture.flags;
  g_bk7258_jpeg_m2m_validation_diag.valid_capture_bytesused =
    capture.bytesused;
  g_bk7258_jpeg_m2m_validation_diag.valid_sequence = capture.sequence;
  g_bk7258_jpeg_m2m_validation_diag.valid_crc32 = valid_stats.crc32;
  g_bk7258_jpeg_m2m_validation_diag.valid_nonzero_bytes = valid_stats.nonzero;
  g_bk7258_jpeg_m2m_validation_diag.valid_min_byte = valid_stats.minimum;
  g_bk7258_jpeg_m2m_validation_diag.valid_max_byte = valid_stats.maximum;
  if (ret < 0)
    {
      goto out;
    }

  g_bk7258_jpeg_m2m_validation_diag.completed_pairs++;
  memset(capture_data, 0xa5, capture_storage);
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_NEGATIVE_QBUF);
  ret = bkjmval_queue_pair(fd, capture_data, capture_storage,
                           BKJMVAL_FIXTURE_BYTES - 2u, 2u);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_NEGATIVE_DQBUF);
  ret = bkjmval_wait_buffers(fd, true, true, &output, &capture);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_NEGATIVE_RESULT);
  ret = bkjmval_validate_negative(&output, &capture, capture_data,
                                   capture_storage);
  g_bk7258_jpeg_m2m_validation_diag.negative_output_flags = output.flags;
  g_bk7258_jpeg_m2m_validation_diag.negative_capture_flags = capture.flags;
  g_bk7258_jpeg_m2m_validation_diag.negative_capture_bytesused =
    capture.bytesused;
  if (ret < 0)
    {
      goto out;
    }

  g_bk7258_jpeg_m2m_validation_diag.completed_pairs++;
  memset(capture_data, 0xa5, capture_storage);
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_RECOVERY_QBUF);
  ret = bkjmval_queue_pair(fd, capture_data, capture_storage,
                           BKJMVAL_FIXTURE_BYTES, 3u);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_RECOVERY_DQBUF);
  ret = bkjmval_wait_buffers(fd, true, true, &output, &capture);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_RECOVERY_RESULT);
  ret = bkjmval_validate_success(&output, &capture, capture_data,
                                 capture_storage, 1u, 3u, &recovery_stats);
  g_bk7258_jpeg_m2m_validation_diag.recovery_capture_flags = capture.flags;
  g_bk7258_jpeg_m2m_validation_diag.recovery_capture_bytesused =
    capture.bytesused;
  g_bk7258_jpeg_m2m_validation_diag.recovery_sequence = capture.sequence;
  g_bk7258_jpeg_m2m_validation_diag.recovery_crc32 = recovery_stats.crc32;
  g_bk7258_jpeg_m2m_validation_diag.recovery_nonzero_bytes =
    recovery_stats.nonzero;
  g_bk7258_jpeg_m2m_validation_diag.recovery_min_byte =
    recovery_stats.minimum;
  g_bk7258_jpeg_m2m_validation_diag.recovery_max_byte =
    recovery_stats.maximum;
  if (ret < 0)
    {
      goto out;
    }

  if (valid_stats.crc32 != recovery_stats.crc32 ||
      valid_stats.nonzero != recovery_stats.nonzero ||
      valid_stats.minimum != recovery_stats.minimum ||
      valid_stats.maximum != recovery_stats.maximum)
    {
      ret = -EILSEQ;
      goto out;
    }

  bkjmval_check_passed();
  g_bk7258_jpeg_m2m_validation_diag.completed_pairs++;
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_DRAIN_QBUF);
  ret = bkjmval_queue_output(fd, BKJMVAL_FIXTURE_BYTES, 4u);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_DRAIN_STREAMOFF);
  type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
  if (ioctl(fd, VIDIOC_STREAMOFF, (unsigned long)(uintptr_t)&type) < 0)
    {
      ret = bkjmval_errno();
      goto out;
    }

  output_on = false;
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_DRAIN_DQBUF);
  ret = bkjmval_wait_buffers(fd, true, false, &output, &capture);
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_DRAIN_RESULT);
  ret = bkjmval_validate_drain(&output);
  g_bk7258_jpeg_m2m_validation_diag.drain_output_flags = output.flags;
  g_bk7258_jpeg_m2m_validation_diag.drain_output_bytesused =
    output.bytesused;
  if (ret < 0)
    {
      goto out;
    }

  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_CAPTURE_STREAMOFF);
  type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  if (ioctl(fd, VIDIOC_STREAMOFF, (unsigned long)(uintptr_t)&type) < 0)
    {
      ret = bkjmval_errno();
      goto out;
    }

  capture_on = false;
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_CLOSE);
  if (close(fd) < 0)
    {
      ret = bkjmval_errno();
      fd = -1;
      goto out;
    }

  fd = -1;
  kmm_free(capture_data);
  bkjmval_check_passed();
  bkjmval_set_stage(BK7258_JPEG_M2M_VALIDATION_STAGE_COMPLETE);
  return 0;

out:
  if (output_on)
    {
      type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
      (void)ioctl(fd, VIDIOC_STREAMOFF, (unsigned long)(uintptr_t)&type);
    }

