open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m_validation.c
  if (capture_on)
    {
      type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
      (void)ioctl(fd, VIDIOC_STREAMOFF, (unsigned long)(uintptr_t)&type);
    }

  if (fd >= 0)
    {
      (void)close(fd);
    }

  kmm_free(capture_data);
  return ret;
}

static void bkjmval_publish_terminal(int result)
{
  g_bk7258_jpeg_m2m_validation_diag.result = result;

  /* State is the terminal publication field.  Every diagnostic word must be
   * globally visible before a debugger can observe PASSED or FAILED.
   */

  __asm volatile ("dmb sy" ::: "memory");
  g_bk7258_jpeg_m2m_validation_diag.state =
    result == 0 ? BK7258_JPEG_M2M_VALIDATION_PASSED :
                  BK7258_JPEG_M2M_VALIDATION_FAILED;
}

static int bkjmval_thread(int argc, FAR char *argv[])
{
  int ret;

  (void)argc;
  (void)argv;

  ret = bkjmval_run();
  bkjmval_publish_terminal(ret);
  if (ret == 0)
    {
      syslog(LOG_INFO,
             "BJMV PASS checks=%" PRIu32 " pairs=%" PRIu32
             " size=%" PRIu32 " crc=%08" PRIx32
             " polls=%" PRIu32 "\n",
             g_bk7258_jpeg_m2m_validation_diag.checks,
             g_bk7258_jpeg_m2m_validation_diag.completed_pairs,
             g_bk7258_jpeg_m2m_validation_diag.valid_capture_bytesused,
             g_bk7258_jpeg_m2m_validation_diag.valid_crc32,
             g_bk7258_jpeg_m2m_validation_diag.poll_calls);
    }
  else
    {
      syslog(LOG_ERR,
             "BJMV FAIL stage=%" PRIu32 " ret=%d checks=%" PRIu32
             " polls=%" PRIu32 "\n",
             g_bk7258_jpeg_m2m_validation_diag.stage, ret,
             g_bk7258_jpeg_m2m_validation_diag.checks,
             g_bk7258_jpeg_m2m_validation_diag.poll_calls);
    }

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_jpeg_m2m_validation_start(void)
{
  uint32_t capture_storage = 0;
  bool expected = false;
  int ret;

  if (!__atomic_compare_exchange_n(&g_bkjmval_started, &expected, true,
                                   false, __ATOMIC_ACQ_REL,
                                   __ATOMIC_ACQUIRE))
    {
      return 0;
    }

  memset((FAR void *)&g_bk7258_jpeg_m2m_validation_diag, 0,
         sizeof(g_bk7258_jpeg_m2m_validation_diag));
  g_bk7258_jpeg_m2m_validation_diag.magic =
    BK7258_JPEG_M2M_VALIDATION_MAGIC;
  g_bk7258_jpeg_m2m_validation_diag.version =
    BK7258_JPEG_M2M_VALIDATION_VERSION;
  g_bk7258_jpeg_m2m_validation_diag.size =
    sizeof(g_bk7258_jpeg_m2m_validation_diag);
  g_bk7258_jpeg_m2m_validation_diag.result = -EINPROGRESS;
  g_bk7258_jpeg_m2m_validation_diag.stage =
    BK7258_JPEG_M2M_VALIDATION_STAGE_INIT;
  g_bk7258_jpeg_m2m_validation_diag.width = BKJMVAL_WIDTH;
  g_bk7258_jpeg_m2m_validation_diag.height = BKJMVAL_HEIGHT;
  g_bk7258_jpeg_m2m_validation_diag.fixture_bytes =
    BKJMVAL_FIXTURE_BYTES;
  g_bk7258_jpeg_m2m_validation_diag.fixture_crc32 =
    bkjmval_crc32(g_bkjmval_fixture, BKJMVAL_FIXTURE_BYTES);
  (void)bkjmval_capture_storage(NULL, &capture_storage);
  g_bk7258_jpeg_m2m_validation_diag.capture_size =
    capture_storage;
  __asm volatile ("dmb sy" ::: "memory");
  g_bk7258_jpeg_m2m_validation_diag.state =
    BK7258_JPEG_M2M_VALIDATION_RUNNING;

  ret = kthread_create("bjpeg-m2m-val", SCHED_PRIORITY_DEFAULT,
                       BKJMVAL_STACKSIZE, bkjmval_thread, NULL);
  if (ret < 0)
    {
      bkjmval_publish_terminal(ret);
      return ret;
    }

  return 0;
}

#endif /* CONFIG_BK7258_JPEG_M2M_VALIDATION */
